test/gasUGKP/chemistryReactor/mesh_evidence/coarse/0/Y_H2
FoamFile { version 2.0; format ascii; class volScalarField; object Y_H2; }
dimensions [0 0 0 0 0 0 0];
internalField uniform 0.028522387527567396;
boundaryField
{
 left { type cyclic; }
 right { type cyclic; }
 sides { type empty; }
}
