test/gasUGKP/chemistryReactor/mesh_evidence/coarse/0/rhoE
FoamFile { version 2.0; format ascii; class volScalarField; object rhoE; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 182755.87568472783;
boundaryField
{
 left { type cyclic; }
 right { type cyclic; }
 sides { type empty; }
}
