test/gasUGKP/chemistryReactor/mesh_evidence/coarse/0/rhoU
FoamFile { version 2.0; format ascii; class volVectorField; object rhoU; }
dimensions [1 -2 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
 left { type cyclic; }
 right { type cyclic; }
 sides { type empty; }
}
